Ramp/steady/predict/trained/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 5E-4;

boundaryField
{
    "(bot)"
    {
        type            nutLowReWallFunction;
        value           $internalField;
    }
    "(sym.*|top)"
    {
        type            symmetry;
    }
    inlet
    {
        type              calculated;
        value             uniform 0;
    }
    outlet
    {
        type              calculated;
        value             uniform 0;
    }

}


// ************************************************************************* //
